app/controllers/articles_controller.rb

  def update
    @article.update(params.require(:article).permit(:title, :description))
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-10-08 17:34:04.233943"], ["id", 1]]